tutorials/WC_EmptyFlume_3D/constant/waveDict1
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      StokesIII;

genAbs          1;

absDir          0.0;//666;

nPaddles        1;

wavePeriod      1.2;

waveHeight      0.06;

waveDir         90;

wavePhase       1.57079633;

tSmooth         0;

uCurrent        (0.2 0.2 0);

